[
    {
        "name": "real",
        "title": "Real",
        "tooltip": "A real datatype in computing is a data type that can represent a wide range of numeric values, including both whole numbers (integers) and numbers with decimal fractions.\n\nThis datatype encompasses all rational numbers (those that can be expressed as a fraction), irrational numbers (such as the square root of 2), and scientific real numbers, making it a versatile choice for storing and manipulating various numeric data in computer programs."
    },
    {
        "name": "boolean",
        "title": "Boolean",
        "tooltip": "A boolean is a binary data type that can hold values of either \"true\" or \"false\", serving as a basis for logical operations; in Revit, it is represented as \"Yes\" or \"No\"."
    },
    {
        "name": "IfcLengthMeasure",
        "title": "IfcLengthMeasure",
        "tooltip": "An IfcLengthMeasure is the value of a distance.\nUsually measured in millimeters (mm).\n\nType: {{REAL}}"
    },
    {
        "name": "label",
        "title": "Label",
        "tooltip": "A label is the term by which something may be referred to. It is a string which represents the human-interpretable name of something and shall have a natural-language meaning.\n\nType: {{STRING}} of up to 255 characters"
    },
    {
        "name": "string",
        "title": "String",
        "tooltip": "A {{string}} is a series of characters, including letters, {{numbers}}, and symbols, grouped together to represent text."
    },
    {
        "name": "numbers",
        "title": "Number",
        "tooltip": "Number is often used as a generic or abstract reference to any data type that represents numeric values, which can include integers, floats, doubles, and more. The {{real}} data type, on the other hand, specifically refers to a subset of numbers that includes rational and irrational numbers, representing values along the {{real}} number line, which encompasses all possible numeric values, including whole numbers and fractions."
    }
]